IDEA StatiCa Open Model
RebarSegment3DArc3Pts.ThirdPoint Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the point of circular arc somewhere between start and end point.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Point3D ThirdPoint { get; set; }
Public Property ThirdPoint As Point3D
	Get
	Set
public:
property Point3D^ ThirdPoint {
	Point3D^ get ();
	void set (Point3D^ value);
}
Property Value
Type: Point3D
See Also
Reference
RebarSegment3DArc3Pts Class
IdeaRS.OpenModel.Model Namespace